/*
 * @Description: 请输入....
 * @Author: Gavin
 * @Date: 2022-01-11 15:24:49
 * @LastEditTime: 2022-06-21 18:34:34
 * @LastEditors: Gavin
 */
const test = [
  ["000001", "周芷若", "技术部"],
  ["000002", "柯镇恶", "技术部"],
  ["000003", "黄药师", "技术部"],
  ["000004", "杨幂", "技术部"],
  ["000005", "张无忌", "技术部"],
  ["000006", "韦小宝", "技术部"],
  ["000007", "乔峰", "技术部"],
  ["000008", "欧阳锋", "技术部"],
  ["000009", "周楠", "技术部"],
  ["000010", "艾薇儿", "技术部"],
  ["000011", "贾斯丁比伯", "技术部"],
  ["000012", "李四", "技术部"],
  ["000013", "鸣人", "技术部"],
  ["000014", "佐良娜", "技术部"],
  ["000015", "卢本伟", "技术部"],
  ["000016", "佐助", "技术部"],
  ["000017", "白骨精", "技术部"],
  ["000018", "铠", "技术部"],
  ["000019", "金角大王", "技术部"],
  ["000020", "银角大王", "技术部"],
  ["000021", "行者孙", "技术部"],
  ["000022", "赵云", "技术部"],
  ["000023", "金克丝", "技术部"],
  ["000024", "蔚", "技术部"],
  ["000025", "张三丰", "技术部"],
  ["000026", "李莫愁", "技术部"],
  ["000027", "赵敏", "技术部"],
  ["000028", "令狐冲", "技术部"],
  ["000029", "东方不败", "技术部"],
  ["000030", "独孤求败", "技术部"],
  ["000031", "段誉", "技术部"],
  ["000032", "王语嫣", "技术部"],
  ["000033", "虚竹", "技术部"],
  ["000034", "慕容复", "技术部"],
  ["000035", "阿朱", "技术部"],
  ["000036", "阿紫", "技术部"],
  ["000037", "岳不群", "技术部"],
  ["000038", "任盈盈", "技术部"],
  ["000039", "左冷禅", "技术部"],
  ["000040", "风清扬", "技术部"],
  ["000041", "宁中则", "技术部"],
  ["000042", "岳灵珊", "技术部"],
  ["000043", "田伯光", "技术部"],
  ["000044", "林平之", "技术部"],
  ["000045", "桃谷六仙", "技术部"],
  ["000046", "蓝凤凰", "技术部"],
  ["000047", "齐白石", "技术部"],
  ["000048", "孙悟空", "技术部"],
  ["000049", "猪八戒", "技术部"],
  ["000050", "唐僧", "技术部"],
  ["000051", "沙僧", "技术部"],
  ["000052", "如来佛祖", "技术部"],
  ["000053", "观音菩萨", "技术部"],
  ["000054", "玉皇大帝", "技术部"],
  ["000055", "二郎神", "技术部"],
  ["000056", "哪吒", "技术部"],
  ["000057", "太上老君", "技术部"],
  ["000058", "雅典娜", "技术部"],
  ["000059", "宙斯", "技术部"],
  ["000060", "哈迪斯", "技术部"],
  ["000061", "雷神", "技术部"],
  ["000062", "钢铁侠", "技术部"],
  ["000063", "美国队长", "技术部"],
  ["000064", "黑寡妇", "技术部"],
  ["000065", "鹰眼", "技术部"],
  ["000066", "绿巨人", "技术部"],
  ["000067", "蜘蛛侠", "技术部"],
  ["000068", "蝙蝠侠", "技术部"],
  ["000069", "超人", "技术部"],
  ["000070", "闪电侠", "技术部"],
  ["000071", "海王", "技术部"],
  ["000072", "奇异博士", "技术部"],
  ["000073", "黑豹", "技术部"],
  ["000074", "惊奇队长", "技术部"],
  ["000075", "猩红女巫", "技术部"],
  ["000076", "幻视", "技术部"],
  ["000077", "洛基", "技术部"],
  ["000078", "灭霸", "技术部"],
  ["000079", "艾斯", "技术部"],
  ["000080", "路飞", "技术部"],
  ["000081", "索隆", "技术部"],
  ["000082", "娜美", "技术部"],
  ["000083", "乌索普", "技术部"],
  ["000084", "山治", "技术部"],
  ["000085", "乔巴", "技术部"],
  ["000086", "罗宾", "技术部"],
  ["000087", "弗兰奇", "技术部"],
  ["000088", "布鲁克", "技术部"],
  ["000089", "甚平", "技术部"],
  ["000090", "白胡子", "技术部"],
  ["000091", "红发香克斯", "技术部"],
  ["000092", "黑胡子", "技术部"],
  ["000093", "卡普", "技术部"],
  ["000094", "赤犬", "技术部"],
  ["000095", "青雉", "技术部"],
  ["000096", "黄猿", "技术部"],
  ["000097", "凯多", "技术部"],
  ["000098", "大妈", "技术部"],
  ["000099", "明哥", "技术部"],
  ["000100", "鹰眼米霍克", "技术部"],
  ["000101", "月关", "技术部"],
  ["000102", "唐三", "技术部"],
  ["000103", "小舞", "技术部"],
  ["000104", "戴沐白", "技术部"],
  ["000105", "朱竹清", "技术部"],
  ["000106", "奥斯卡", "技术部"],
  ["000107", "宁荣荣", "技术部"],
  ["000108", "马红俊", "技术部"],
  ["000109", "白沉香", "技术部"],
  ["000110", "比比东", "技术部"],
  ["000111", "千仞雪", "技术部"],
  ["000112", "叶问", "技术部"],
  ["000113", "李小龙", "技术部"],
  ["000114", "成龙", "技术部"],
  ["000115", "甄子丹", "技术部"],
  ["000116", "李连杰", "技术部"],
  ["000117", "吴京", "技术部"],
  ["000118", "周星驰", "技术部"],
  ["000119", "刘德华", "技术部"],
  ["000120", "周杰伦", "技术部"],
  ["000121", "李荣浩", "技术部"],
  ["000122", "张国荣", "技术部"],
  ["000123", "周润发", "技术部"],
  ["000124", "向华强", "技术部"],
  ["000125", "小鬼", "技术部"],
  ["000126", "林俊杰", "技术部"],
  ["000127", "薛之谦", "技术部"],
  ["000128", "王力宏", "技术部"],
  ["000129", "刘若英", "技术部"],
  ["000130", "梁静茹", "技术部"],
  ["000131", "冯提莫", "技术部"],
  ["000132", "卡兹克", "技术部"],
  ["000133", "韩信", "技术部"],
  ["000134", "李白", "技术部"],
  ["000135", "荆轲", "技术部"],
  ["000136", "甄姬", "技术部"],
  ["000137", "貂蝉", "技术部"],
  ["000138", "吕布", "技术部"],
  ["000139", "关羽", "技术部"],
  ["000140", "张飞", "技术部"],
  ["000141", "刘备", "技术部"],
  ["000142", "曹操", "技术部"],
  ["000143", "典韦", "技术部"],
  ["000144", "许褚", "技术部"],
  ["000145", "黄忠", "技术部"],
  ["000146", "马超", "技术部"],
  ["000147", "廉颇", "技术部"],
  ["000148", "程咬金", "技术部"],
  ["000149", "兰陵王", "技术部"],
  ["000150", "花木兰", "技术部"],
  ["000151", "雅典娜", "技术部"],
  ["000152", "不知火舞", "技术部"],
  ["000153", "橘右京", "技术部"],
  ["000154", "阿轲", "技术部"],
  ["000155", "孙尚香", "技术部"],
  ["000156", "露娜", "技术部"],
  ["000157", "宫本武藏", "技术部"],
  ["000158", "武则天", "技术部"],
  ["000159", "王昭君", "技术部"],
  ["000160", "杨玉环", "技术部"],
  ["000161", "鲁班七号", "技术部"],
  ["000162", "小乔", "技术部"],
  ["000163", "大乔", "技术部"],
  ["000164", "狄仁杰", "技术部"],
  ["000165", "黄忠", "技术部"],
  ["000166", "虞姬", "技术部"],
  ["000167", "伽罗", "技术部"],
  ["000168", "安琪拉", "技术部"],
  ["000169", "妲己", "技术部"],
  ["000170", "嬴政", "技术部"],
  ["000171", "高渐离", "技术部"],
  ["000172", "诸葛亮", "技术部"],
  ["000173", "阿珂", "技术部"],
  ["000174", "百里玄策", "技术部"],
  ["000175", "百里守约", "技术部"],
  ["000176", "盘古", "技术部"],
  ["000177", "瑶", "技术部"],
  ["000178", "上官婉儿", "技术部"],
  ["000179", "嫦娥", "技术部"],
  ["000180", "姜子牙", "技术部"],
  ["000181", "马可波罗", "技术部"],
  ["000182", "米莱狄", "技术部"],
  ["000183", "沈梦溪", "技术部"],
  ["000184", "司马懿", "技术部"],
  ["000185", "孙膑", "技术部"],
  ["000186", "周瑜", "技术部"],
  ["000187", "庄周", "技术部"],
  ["000188", "李元芳", "技术部"],
  ["000189", "公孙离", "技术部"],
  ["000190", "达摩", "技术部"],
  ["000191", "艾琳", "技术部"],
  ["000192", "阿古朵", "技术部"],
  ["000193", "蒙恬", "技术部"],
  ["000194", "夏洛特", "技术部"],
  ["000195", "海月", "技术部"],
  ["000196", "云缨", "技术部"],
  ["000197", "金蝉", "技术部"],
  ["000198", "暃", "技术部"],
  ["000199", "戈娅", "技术部"],
  ["000200", "桑启", "技术部"],
];

function randomsort(a, b) {
  return Math.random() > 0.5 ? -1 : 1;
  //用Math.random()函数生成0~1之间的随机数与0.5比较，返回-1或1
}

const user = test.sort(randomsort);
/**
 * 卡片公司名称标识
 */
const COMPANY = "乐读";
/**
 * 奖品设置
 * type: 唯一标识，0是默认特别奖的占位符，其它奖品不可使用
 * count: 奖品数量
 * title: 奖品描述
 * text: 奖品标题
 * img: 图片地址
 * ROTATE_TIME:转的球速度越大越慢
 * circle:旋转圈数最好8*x倍数
 * enter: //抽奖进行时音乐
 * awards: //颁奖音乐
 */
const prizes = [
  {
    type: 0,
    count: 1000,
    title: "抽奖结束",
    text: "需要重新抽奖请配置后重置",
  },
  {
    type: 1,
    count: 1,
    text: "一等奖 ",
    title: "价值5999元",
    img: "./img/huawei.png",
    enter: "1st-lottery", //抽奖进行时音乐
    awards: "1st-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 20000,
    circle: 8 * 6,
  },
  {
    type: 2,
    count: 2,
    text: "二等奖 ",
    title: "价值3799元",
    img: "./img/mbp.jpg",
    enter: "other-lottery", //抽奖进行时音乐
    awards: "other-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 20000,
    circle: 8 * 3,
  },
  {
    type: 3,
    count: 5,
    text: "三等奖  ",
    title: "价值1200元",
    img: "./img/ipad.jpg",
    enter: "other-lottery", //抽奖进行时音乐
    awards: "other-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 10000,
    circle: 8 * 3,
  },
  {
    type: 4,
    count: 10,
    text: "四等奖",
    title: "价值300-600元不等",
    img: "./img/edifier.jpg",
    enter: "other-lottery", //抽奖进行时音乐
    awards: "other-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 10000,
    circle: 8 * 1,
  },
];
let luckyData = JSON.parse(localStorage.getItem("luckyData")) || {};

let leftUsers = JSON.parse(localStorage.getItem("leftUsers")) || user;

let awardList = JSON.parse(localStorage.getItem("awardList")) || {};

//不能说的秘密
const excludeUser = [["000005", "张无忌", "技术部"]];
/**
 * @description: 不能说的秘密
 * @param {*} nowItem 当前奖品
 * @param {*} basicData 当前奖池人员
 * @return {*}
 * @Date: 2022-01-13 15:13:31
 */
function setSecret(nowItem, basicData) {
  if (nowItem.type != 4) {
    // console.log(mockData.excludeUser);
    const excludeId = excludeUser.map((item) => item[0]);
    // console.log(excludeId, basicData.leftUsers);
    basicData.leftUsers = basicData.leftUsers.filter(
      (human) => !excludeId.includes(human[0])
    );
    // console.log(basicData.leftUsers);
  }
}
//颜色
const rgba = "0,0,0";
//透明度
const opacity = () => 0.3 || Math.random() * 0.7 + 0.25;
//气氛组卡片
const atmosphereGroupCard = () => `rgba(${rgba},${opacity()})`;
//背景色
const background =
  "url(https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fimg.zcool.cn%2Fcommunity%2F01ef5e59c878d5a8012053f8c53ab7.jpg%401280w_1l_2o_100sh.jpg&refer=http%3A%2F%2Fimg.zcool.cn&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=jpeg?sec=1645253836&t=e6413ccc6469632cf5476f5f6067e13b)";
//背景动态壁纸模式 不用时可以设置为null或者注释
// const bgVideo="//game.gtimg.cn/images/lol/act/a20220121lunarpass/bg.mp4"
const width = window.innerWidth * 0.75;
const height = window.innerWidth * 0.75 * 0.75;
/**
 * 一次抽取的奖品个数与prizes对应
 */
const EACH_COUNT = [1, 1, 1, 5, 5];
export default {
  EACH_COUNT,
  prizes,
  COMPANY,
  user,
  luckyData,
  leftUsers,
  awardList,
  excludeUser,
  atmosphereGroupCard,
  background,
  setSecret,
  width,
  height,
  bgVideo,
};
