/*
 * @Description: 请输入....
 * @Author: Gavin
 * @Date: 2022-01-11 15:24:49
 * @LastEditTime: 2022-06-21 18:34:34
 * @LastEditors: Gavin
 */
const test = [
  ["000001", "周芷若" ],
  ["000002", "柯镇恶" ],
  ["000003", "黄药师" ],
  ["000004", "杨幂" ],
  ["000005", "张无忌" ],
  ["000006", "韦小宝" ],
  ["000007", "乔峰" ],
  ["000008", "欧阳锋" ],
  ["000009", "周楠" ],
  ["000010", "艾薇儿" ],
  ["000011", "贾斯丁比伯" ],
  ["000012", "李四" ],
  ["000013", "鸣人" ],
  ["000014", "佐良娜" ],
  ["000015", "卢本伟" ],
  ["000016", "佐助" ],
  ["000017", "白骨精" ],
  ["000018", "铠" ],
  ["000019", "金角大王" ],
  ["000020", "银角大王" ],
  ["000021", "行者孙" ],
  ["000022", "赵云" ],
  ["000023", "金克丝" ],
  ["000024", "蔚" ],
  ["000025", "张三丰" ],
  ["000026", "李莫愁" ],
  ["000027", "赵敏" ],
  ["000028", "令狐冲" ],
  ["000029", "东方不败" ],
  ["000030", "独孤求败" ],
  ["000031", "段誉" ],
  ["000032", "王语嫣" ],
  ["000033", "虚竹" ],
  ["000034", "慕容复" ],
  ["000035", "阿朱" ],
  ["000036", "阿紫" ],
  ["000037", "岳不群" ],
  ["000038", "任盈盈" ],
  ["000039", "左冷禅" ],
  ["000040", "风清扬" ],
  ["000041", "宁中则" ],
  ["000042", "岳灵珊" ],
  ["000043", "田伯光" ],
  ["000044", "林平之" ],
  ["000045", "桃谷六仙" ],
  ["000046", "蓝凤凰" ],
  ["000047", "齐白石" ],
  ["000048", "孙悟空" ],
  ["000049", "猪八戒" ],
  ["000050", "唐僧" ],
  ["000051", "沙僧" ],
  ["000052", "如来佛祖" ],
  ["000053", "观音菩萨" ],
  ["000054", "玉皇大帝" ],
  ["000055", "二郎神" ],
  ["000056", "哪吒" ],
  ["000057", "太上老君" ],
  ["000058", "雅典娜" ],
  ["000059", "宙斯" ],
  ["000060", "哈迪斯" ],
  ["000061", "雷神" ],
  ["000062", "钢铁侠" ],
  ["000063", "美国队长" ],
  ["000064", "黑寡妇" ],
  ["000065", "鹰眼" ],
  ["000066", "绿巨人" ],
  ["000067", "蜘蛛侠" ],
  ["000068", "蝙蝠侠" ],
  ["000069", "超人" ],
  ["000070", "闪电侠" ],
  ["000071", "海王" ],
  ["000072", "奇异博士" ],
  ["000073", "黑豹" ],
  ["000074", "惊奇队长" ],
  ["000075", "猩红女巫" ],
  ["000076", "幻视" ],
  ["000077", "洛基" ],
  ["000078", "灭霸" ],
  ["000079", "艾斯" ],
  ["000080", "路飞" ],
  ["000081", "索隆" ],
  ["000082", "娜美" ],
  ["000083", "乌索普" ],
  ["000084", "山治" ],
  ["000085", "乔巴" ],
  ["000086", "罗宾" ],
  ["000087", "弗兰奇" ],
  ["000088", "布鲁克" ],
  ["000089", "甚平" ],
  ["000090", "白胡子" ],
  ["000091", "红发香克斯" ],
  ["000092", "黑胡子" ],
  ["000093", "卡普" ],
  ["000094", "赤犬" ],
  ["000095", "青雉" ],
  ["000096", "黄猿" ],
  ["000097", "凯多" ],
  ["000098", "大妈" ],
  ["000099", "明哥" ],
  ["000100", "鹰眼米霍克" ],
  ["000101", "月关" ],
  ["000102", "唐三" ],
  ["000103", "小舞" ],
  ["000104", "戴沐白" ],
  ["000105", "朱竹清" ],
  ["000106", "奥斯卡" ],
  ["000107", "宁荣荣" ],
  ["000108", "马红俊" ],
  ["000109", "白沉香" ],
  ["000110", "比比东" ],
  ["000111", "千仞雪" ],
  ["000112", "叶问" ],
  ["000113", "李小龙" ],
  ["000114", "成龙" ],
  ["000115", "甄子丹" ],
  ["000116", "李连杰" ],
  ["000117", "吴京" ],
  ["000118", "周星驰" ],
  ["000119", "刘德华" ],
  ["000120", "周杰伦" ],
  ["000121", "李荣浩" ],
  ["000122", "张国荣" ],
  ["000123", "周润发" ],
  ["000124", "向华强" ],
  ["000125", "小鬼" ],
  ["000126", "林俊杰" ],
  ["000127", "薛之谦" ],
  ["000128", "王力宏" ],
  ["000129", "刘若英" ],
  ["000130", "梁静茹" ],
  ["000131", "冯提莫" ],
  ["000132", "卡兹克" ],
  ["000133", "韩信" ],
  ["000134", "李白" ],
  ["000135", "荆轲" ],
  ["000136", "甄姬" ],
  ["000137", "貂蝉" ],
  ["000138", "吕布" ],
  ["000139", "关羽" ],
  ["000140", "张飞" ],
  ["000141", "刘备" ],
  ["000142", "曹操" ],
  ["000143", "典韦" ],
  ["000144", "许褚" ],
  ["000145", "黄忠" ],
  ["000146", "马超" ],
  ["000147", "廉颇" ],
  ["000148", "程咬金" ],
  ["000149", "兰陵王" ],
  ["000150", "花木兰" ],
  ["000151", "雅典娜" ],
  ["000152", "不知火舞" ],
  ["000153", "橘右京" ],
  ["000154", "阿轲" ],
  ["000155", "孙尚香" ],
  ["000156", "露娜" ],
  ["000157", "宫本武藏" ],
  ["000158", "武则天" ],
  ["000159", "王昭君" ],
  ["000160", "杨玉环" ],
  ["000161", "鲁班七号" ],
  ["000162", "小乔" ],
  ["000163", "大乔" ],
  ["000164", "狄仁杰" ],
  ["000165", "黄忠" ],
  ["000166", "虞姬" ],
  ["000167", "伽罗" ],
  ["000168", "安琪拉" ],
  ["000169", "妲己" ],
  ["000170", "嬴政" ],
  ["000171", "高渐离" ],
  ["000172", "诸葛亮" ],
  ["000173", "阿珂" ],
  ["000174", "百里玄策" ],
  ["000175", "百里守约" ],
  ["000176", "盘古" ],
  ["000177", "瑶" ],
  ["000178", "上官婉儿" ],
  ["000179", "嫦娥" ],
  ["000180", "姜子牙" ],
  ["000181", "马可波罗" ],
  ["000182", "米莱狄" ],
  ["000183", "沈梦溪" ],
  ["000184", "司马懿" ],
  ["000185", "孙膑" ],
  ["000186", "周瑜" ],
  ["000187", "庄周" ],
  ["000188", "李元芳" ],
  ["000189", "公孙离" ],
  ["000190", "达摩" ],
  ["000191", "艾琳" ],
  ["000192", "阿古朵" ],
  ["000193", "蒙恬" ],
  ["000194", "夏洛特" ],
  ["000195", "海月" ],
  ["000196", "云缨" ],
  ["000197", "金蝉" ],
  ["000198", "暃" ],
  ["000199", "戈娅" ],
  ["000200", "桑启" ],
];

function randomsort(a, b) {
  return Math.random() > 0.5 ? -1 : 1;
  //用Math.random()函数生成0~1之间的随机数与0.5比较，返回-1或1
}

const user = test.sort(randomsort);
/**
 * 卡片公司名称标识
 */
const COMPANY = "乐读";
/**
 * 奖品设置
 * type: 唯一标识，0是默认特别奖的占位符，其它奖品不可使用
 * count: 奖品数量
 * title: 奖品描述
 * text: 奖品标题
 * img: 图片地址
 * ROTATE_TIME:转的球速度越大越慢
 * circle:旋转圈数最好8*x倍数
 * enter: //抽奖进行时音乐
 * awards: //颁奖音乐
 */
const prizes = [
  {
    type: 0,
    count: 1000,
    title: "抽奖结束",
    text: "需要重新抽奖请配置后重置",
  },
  {
    type: 1,
    count: 1,
    text: "一等奖 ",
    title: "价值5999元",
    img: "./img/huawei.png",
    enter: "1st-lottery", //抽奖进行时音乐
    awards: "1st-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 20000,
    circle: 8 * 6,
  },
  {
    type: 2,
    count: 2,
    text: "二等奖 ",
    title: "价值3799元",
    img: "./img/mbp.jpg",
    enter: "other-lottery", //抽奖进行时音乐
    awards: "other-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 20000,
    circle: 8 * 3,
  },
  {
    type: 3,
    count: 5,
    text: "三等奖  ",
    title: "价值1200元",
    img: "./img/ipad.jpg",
    enter: "other-lottery", //抽奖进行时音乐
    awards: "other-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 10000,
    circle: 8 * 3,
  },
  {
    type: 4,
    count: 10,
    text: "四等奖",
    title: "价值300-600元不等",
    img: "./img/edifier.jpg",
    enter: "other-lottery", //抽奖进行时音乐
    awards: "other-BJ-BGM", //颁奖音乐
    ROTATE_TIME: 10000,
    circle: 8 * 1,
  },
];
let luckyData = JSON.parse(localStorage.getItem("luckyData")) || {};

let leftUsers = JSON.parse(localStorage.getItem("leftUsers")) || user;

let awardList = JSON.parse(localStorage.getItem("awardList")) || {};

//不能说的秘密
const excludeUser = [["000005", "张无忌" ]];
/**
 * @description: 不能说的秘密
 * @param {*} nowItem 当前奖品
 * @param {*} basicData 当前奖池人员
 * @return {*}
 * @Date: 2022-01-13 15:13:31
 */
function setSecret(nowItem, basicData) {
  if (nowItem.type != 4) {
    // console.log(mockData.excludeUser);
    const excludeId = excludeUser.map((item) => item[0]);
    // console.log(excludeId, basicData.leftUsers);
    basicData.leftUsers = basicData.leftUsers.filter(
      (human) => !excludeId.includes(human[0])
    );
    // console.log(basicData.leftUsers);
  }
}
//颜色
const rgba = "0,0,0";
//透明度
const opacity = () => 0.3 || Math.random() * 0.7 + 0.25;
//气氛组卡片
const atmosphereGroupCard = () => `rgba(${rgba},${opacity()})`;
//背景色
const background =
  "url(https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fimg.zcool.cn%2Fcommunity%2F01ef5e59c878d5a8012053f8c53ab7.jpg%401280w_1l_2o_100sh.jpg&refer=http%3A%2F%2Fimg.zcool.cn&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=jpeg?sec=1645253836&t=e6413ccc6469632cf5476f5f6067e13b)";
//背景动态壁纸模式 不用时可以设置为null或者注释
// const bgVideo="//game.gtimg.cn/images/lol/act/a20220121lunarpass/bg.mp4"
const width = window.innerWidth * 0.75;
const height = window.innerWidth * 0.75 * 0.75;
/**
 * 一次抽取的奖品个数与prizes对应
 */
const EACH_COUNT = [1, 1, 1, 5, 5];
export default {
  EACH_COUNT,
  prizes,
  COMPANY,
  user,
  luckyData,
  leftUsers,
  awardList,
  excludeUser,
  atmosphereGroupCard,
  background,
  setSecret,
  width,
  height,
  bgVideo,
};
